### Terraform Initialization `$success`

### Terraform Validation `$success`

<details><summary>Validation Output</summary>

```

$Success! The configuration is valid.


```

</details>

### Terraform Plan `$success`

<details><summary>Show Plan</summary>

```

Acquiring state lock. This may take a few moments...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_artifact_registry_repository.test_repo will be created
  + resource "google_artifact_registry_repository" "test_repo" {
      + create_time      = (known after apply)
      + effective_labels = (known after apply)
      + format           = "DOCKER"
      + id               = (known after apply)
      + location         = "europe-west1"
      + mode             = "STANDARD_REPOSITORY"
      + name             = (known after apply)
      + project          = "oredata-ops-demo"
      + repository_id    = "test-repository-01"
      + terraform_labels = (known after apply)
      + update_time      = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: ../plan.out

To perform exactly these actions, run the following command to apply:
    terraform apply "../plan.out"

$
Terraform used the selected providers to generate the following execution
  + create

Terraform will perform the following actions:

  # google_artifact_registry_repository.test_repo will be created
  + resource "google_artifact_registry_repository" "test_repo" {
      + create_time      = (known after apply)
      + effective_labels = (known after apply)
      + format           = "DOCKER"
      + id               = (known after apply)
      + location         = "europe-west1"
      + mode             = "STANDARD_REPOSITORY"
      + name             = (known after apply)
      + project          = "oredata-ops-demo"
      + repository_id    = "test-repository-01"
      + terraform_labels = (known after apply)
      + update_time      = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.


Saved the plan to: ../plan.out

To perform exactly these actions, run the following command to apply:
    terraform apply "../plan.out"
```

</details>

### Terraform Apply `$skipped`

*Pusher: @$salihdemirer-oredata, Action: `$pull_request`, Working Directory: `$`, Workflow: `$Terraform Workflow`*